const skyUnite = {
   rings:{
      "itemId":"3b62a91abc21df1a2609af53cb15d432",
      "itemName":"천계 연합군 : 모든 이를 위한 기도",
      "ispinsInfo":{
         "options":[{
            "buff":1405,
            "explain":"물리, 마법 방어력 총 합이 90000 이상일 때 피해 증가 +7815\n\n물리, 마법 방어력 +14000\n\n피격 시 물리, 마법 방어력 -2800","explainDetail":"물리, 마법 방어력 총 합이 90000 이상일 때 피해 증가 +7815\n\n물리, 마법 방어력 +14000\n\n피격 시 물리, 마법 방어력 -2800 (최대 5중첩, 해당 옵션의 피격 판정은 총 HP 1% 이상 데미지를 받을 시에만 적용됩니다.)\n- 2초 동안 피격되지 않을 시 물리, 마법 방어력 감소 중첩수 1 감소"}]}},
   neck:{
      "itemId":"cb41d2e497f1a7ac1ae2711670da9861",
      "itemName":"천계 연합군 : 꺾이지 않는 의지",
      "ispinsInfo":{
         "options":[{
            "buff":1405,
            "explain":"HP MAX, MP MAX 총 합이 220000 이상일 때 피해 증가 +7815\n\nHP MAX +1200, MP MAX +1890\n\n피격 시 HP MAX -240, MP MAX -378","explainDetail":"HP MAX, MP MAX 총 합이 220000 이상일 때 피해 증가 +7815\n\nHP MAX +1200, MP MAX +1890\n\n피격 시 HP MAX -240, MP MAX -378 (최대 5중첩, 해당 옵션의 피격 판정은 총 HP 1% 이상 데미지를 받을 시에만 적용됩니다.)\n- 2초 동안 피격되지 않을 시 HP MAX, MP MAX 감소 중첩수 1 감소"}]}},
   armlet:{
      "itemId":"f0683ab71a21f9166ccb3423fa0a928c",
      "itemName":"천계 연합군 : 밝게 빛나는 희망",
      "ispinsInfo":{
         "options":[{
            "buff":1405,
            "explain":"모든 속성 저항 총 합이 100 이상일 때 피해 증가 +7815\n\n모든 속성 저항 +20\n\n피격 시 모든 속성 저항 -4",
            "explainDetail":"모든 속성 저항 총 합이 100 이상일 때 피해 증가 +7815\n\n모든 속성 저항 +20\n\n피격 시 모든 속성 저항 -4 (최대 5중첩, 해당 옵션의 피격 판정은 총 HP 1% 이상 데미지를 받을 시에만 적용됩니다.)\n- 2초 동안 피격되지 않을 시 모든 속성 저항 감소 중첩수 1 감소"}]}}}
            
const goldDragon = {
   rings:{ 
      "itemId": "52688ab6a97da9368e86343d0a3ac4a5", 
      "itemName": "금룡 : 무한한 빛의 결계", 
      "ispinsInfo": { 
         "options": [{ 
            "buff": 1405, 
            "explain": "공격 시 30% 확률로 랜덤한 효과 적용", 
            "explainDetail": "공격 시 30% 확률로 아래의 효과 3개 중 1개 효과 적용 (쿨타임 3초, 최대 1중첩, 적의 방어력과 상관없이 총 피해 증가 수치의 100%만큼 피해를 줌)\n- 200px 범위 내에 있는 랜덤한 적에게 테서랙트 붐을 1회 시전하며, 피해 증가 +7034\n- 300px 범위 내에 있는 랜덤한 적에게 테서랙트 붐을 최대 3회 시전하며, 피해 증가 +7815\n- 500px 범위 내에 있는 랜덤한 적에게 테서랙트 붐을 최대 5회 시전하며, 피해 증가 +8597" }]
         }      
   },
   neck: { 
      "itemId": "eeb469cdd183e41318837d2dbd98dd42", 
      "itemName": "금룡 : 찬란한 용의 비늘", 
      "ispinsInfo": { 
         "options": [{
            "buff": 1405,
            "explain": "공격 시 30% 확률로 랜덤한 효과 적용",
            "explainDetail": "공격 시 30% 확률로 아래의 효과 3개 중 1개 효과 적용 (쿨타임 3초, 최대 1중첩, 적의 방어력과 상관없이 총 피해 증가 수치의 100%만큼 피해를 줌)\n- 200px 범위 내에 있는 랜덤한 적에게 호리젠탈 큐브를 1회 시전하며, 피해 증가 +7034\n- 300px 범위 내에 있는 랜덤한 적에게 호리젠탈 큐브를 최대 3회 시전하며, 피해 증가 +7815\n- 500px 범위 내에 있는 랜덤한 적에게 호리젠탈 큐브를 최대 5회 시전하며, 피해 증가 +8597" }]
         }
   },
   armlet:{ 
      "itemId": "5285d14664a9aa41559ca68f440c3909", 
      "itemName": "금룡 : 화려한 힘의 기원", 
      "ispinsInfo": { 
         "options": [{ 
            "buff": 1405, 
            "explain": "공격 시 30% 확률로 랜덤한 효과 적용", 
            "explainDetail": "공격 시 30% 확률로 아래의 효과 3개 중 1개 효과 적용 (쿨타임 3초, 최대 1중첩, 적의 방어력과 상관없이 총 피해 증가 수치의 100%만큼 피해를 줌)\n- 200px 범위 내에 있는 랜덤한 적에게 버티컬 필러를 1회 시전하며, 피해 증가 +7034\n- 300px 범위 내에 있는 랜덤한 적에게 버티컬 필러를 최대 3회 시전하며, 피해 증가 +7815\n- 500px 범위 내에 있는 랜덤한 적에게 버티컬 필러를 최대 5회 시전하며, 피해 증가 +8597" }]
         }}}